# EA_DataAccCreate

## Description
Returns accessory index. The function opens a &amp;quot;session&amp;quot; to energy analysis plugin for particular handle. The handle is a handle to record format or to object.

```pascal
FUNCTION EA_DataAccCreate(
				type : INTEGER;
				h    : HANDLE) : INTEGER;
```

```python

def vs.EA_DataAccCreate(type, h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|type|INTEGER||
|h|HANDLE||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library